## Given a string for example: “This is the first python test”, get the list of vowels and Given a string for example: “This is the first python test”, get the list of vowels and consonants separately.

In [ ]:
input_string = 'This is the first python test'
input_string = input_string.replace(' ', '')
print(input_string)

print(len(input_string))
vowels = []
constants = []
for char in input_string:
    if char in ['a', 'e', 'i', 'o', 'u']:
        vowels.append(char)
    else:
        constants.append(char)

print(vowels)
print(constants)

## Given an array, get the kth largest element in the array. Write a function to get this. The inputs to the function are array and the kth value. 
## Hint: Use list.sort() 
## Example: Input arr=[2,4,12,8,6,9,10], k=2 Output: 10

In [ ]:
def get_kth_value(arr, k):
    input_array = sorted(arr)
    print(input_array)
    kth_element = input_array[-k]
    return kth_element

get_kth_value([2,4,12,8,6,9,10], 2)

## There is an array in which the elements are repeated twice and one element is repeated thrice. Using NumPy, find that repeated element.
## Example:
## Input arr = [2,4,6,2,6,4,8,9,7,7,8,9,8]
## Output = 8

In [ ]:
import numpy as np

arr = np.array([2,4,6,2,6,4,8,9,7,7,8,9,8])
uniques, uniq_idx, counts = np.unique(arr,return_index=True,return_counts=True)
duplicates = arr[ uniq_idx[counts>=3]]

print(duplicates)

 ## i) Create Numpy arrays for the following points: A(1,2,3) and B(2,4,5).
 ## ii) Multiply the two arrays (element-wise multiplication)
 ## iii) Add the two arrays and divide them by 2. Call it as C (element-wise addition)
 ## iv) Find the distance between the C and the other two points:

In [ ]:
# i)
A = np.arange(start=1, stop=4, step=1)
print(A)

B = np.arange(start=2, stop=6, step=1)
B = B[B != 3]
print(B)

# ii)
mult = np.multiply(A, B)
print(mult)

# iii)
C = np.add(A, B)
print(C)

# iv)
dist_c_b =  np.sum(np.square(C-B))
print(dist_c_b)

dist_c_a =  np.sum(np.square(C-A))
print(dist_c_a)

## Using the list comprehensions, get the list of squares of numbers in the range of 10 and find their sum.

In [ ]:
squares_list = [x**2 for x in range(10)]
print(list_variable)
sum_squares = sum(list_variable)
print(sum_squares)

In [6]:
import pandas as pd

DataFrame = pd.read_csv('Dataset/bank.csv', sep=';')
DataFrame.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [7]:
DataFrame.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [13]:
DataFrame['job'] = DataFrame['job'].astype('category')
DataFrame.describe(include='category')

               job
count         4521
unique          12
top     management
freq           969

## What is the mean ‘balance’ for people with marital status as married and also education as tertiary?

In [18]:
data_marital = pd.read_csv('Dataset/bank.csv', sep=';', index_col ="marital")
rows = data_marital.loc[["married"]]
rows
data_marital['balance'].mean()

1422.6578190665782

## Drop the following columns from the dataframe: job, day, month, pdays, previous and poutcome

In [19]:
DataFrame.drop('job', axis=1, inplace=True)
DataFrame.drop('day', axis=1, inplace=True)
DataFrame.drop('month', axis=1, inplace=True)
DataFrame.drop('pdays', axis=1, inplace=True)
DataFrame.drop('previous', axis=1, inplace=True)
DataFrame.drop('poutcome', axis=1, inplace=True)
DataFrame.head()

,age,marital,education,default,balance,housing,loan,contact,duration,campaign,y
0,30,married,primary,no,1787,no,no,cellular,79,1,no
1,33,married,secondary,no,4789,yes,yes,cellular,220,1,no
2,35,single,tertiary,no,1350,yes,no,cellular,185,1,no
3,30,married,tertiary,no,1476,yes,yes,unknown,199,4,no
4,59,married,secondary,no,0,yes,no,unknown,226,1,no

## Recode categorical variables with 2 levels as 0 & 1

In [20]:
DataFrame.dtypes
DataFrame

age           int64
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
duration      int64
campaign      int64
y            object
dtype: object

In [21]:
object_attr = list(DataFrame.select_dtypes('object').columns)
object_attr
for item in object_attr:
    DataFrame[item] = DataFrame[item].astype('category')

In [22]:
DataFrame.describe(include='category')

        marital  education default housing  loan   contact     y
count      4521       4521    4521    4521  4521      4521  4521
unique        3          4       2       2     2         3     2
top     married  secondary      no     yes    no  cellular    no
freq       2797       2306    4445    2559  3830      2896  4000

In [28]:
DataFrame = DataFrame.replace(to_replace = ['yes','no'],value = ['1','0'])